
export default {
  state: {
    feedbacks: [
      {
        name: 'Іван',
        text: 'Замовляв у цьому магазині вперше і був  приємно вражений, товари високої якості, хоча мають низьку ціну. Однозначно буду замовляти тут ще.',
        avatar: require('../assets/images/feedbackUsers/Ivan.jpg')
      },
      {
        name: 'Влад',
        text: 'Уже став постійним клієнтом у цьому магазині. Купую тут насіння для кожного сезону і ще не був розчарованим. Подобається ціна, якість та швидкість доставки. Дякую!',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      },
      {
        name: 'София',
        text: 'На карантине я столкнулась с проблемой закрытых рынков и уже думала, что этот сезон упущен, поэтому решила попробовать заказать семена через интернет и нашла этот сайт. Первые семена уже проросли, так что теперь буду покупать только здесь.',
        avatar: require('../assets/images/feedbackUsers/sophia.jpg')
      },
      {
        name: 'Андрей',
        text: 'Недавно заказывал  здесь семена  гречки. Сначала сомневался будет ли все так же качественно, но результат не заставил себя долго ждать и урожай я получил один из лучших за последнее время. Теперь у меня есть магазин, которому я могу доверять, спасибо.',
        avatar: require('../assets/images/feedbackUsers/Andrew.jpg')
      },
      {
        name: 'Таня',
        text: 'Загалом ціни і якість насіння чудові, але швидкість доставки не дуже, бо чекала на доставку аж 3 дні.',
        avatar: require('../assets/images/feedbackUsers/tanya.jpg')
      },
      {
        name: 'Богдан',
        text: 'Купив насіння білої конюшини і люцерни, по результатах можу сказати, що товар якісний. На осінь буду замовляти ще.',
        avatar: require('../assets/images/feedbackUsers/bodya.jpg')
      }
    ]
  },
  mutations: {

  },
  getters: {
    getFeedBacks (state) {
      return state.feedbacks
    }
  }
}
