
export default {
  state: {
    feedbacks: [
      {
        name: 'Іван',
        text: 'Замовляла боді та майки чоловікові. Усе хорошої якості. Розміри як у таблиці. Приємно, що це ще й український виробник. Магазин швидко усе доставив. Дякую.',
        avatar: require('../assets/images/feedbackUsers/vanya.jpg')
      },
      {
        name: 'Влад',
        text: 'Трусики от фирмы Mery мне подарила мама, на первый взгляд обычные трусики, но это только на первый взгляд. Трусики идут с легкой, нежной ткани, приятной для тела. рактически их не ощущаю на теле, люблю легкое белье. ',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      },
      {
        name: 'Іван',
        text: 'Замовляла боді та майки чоловікові. Усе хорошої якості. Розміри як у таблиці. Приємно, що це ще й український виробник. Магазин швидко усе доставив. Дякую.',
        avatar: require('../assets/images/feedbackUsers/vanya.jpg')
      },
      {
        name: 'Влад',
        text: 'Трусики от фирмы Mery мне подарила мама, на первый взгляд обычные трусики, но это только на первый взгляд. Трусики идут с легкой, нежной ткани, приятной для тела. рактически их не ощущаю на теле, люблю легкое белье. ',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      },
      {
        name: 'Іван',
        text: 'Замовляла боді та майки чоловікові. Усе хорошої якості. Розміри як у таблиці. Приємно, що це ще й український виробник. Магазин швидко усе доставив. Дякую.',
        avatar: require('../assets/images/feedbackUsers/vanya.jpg')
      },
      {
        name: 'Влад',
        text: 'Трусики от фирмы Mery мне подарила мама, на первый взгляд обычные трусики, но это только на первый взгляд. Трусики идут с легкой, нежной ткани, приятной для тела. рактически их не ощущаю на теле, люблю легкое белье. ',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      },
      {
        name: 'Іван',
        text: 'Замовляла боді та майки чоловікові. Усе хорошої якості. Розміри як у таблиці. Приємно, що це ще й український виробник. Магазин швидко усе доставив. Дякую.',
        avatar: require('../assets/images/feedbackUsers/vanya.jpg')
      },
      {
        name: 'Влад',
        text: 'Трусики от фирмы Mery мне подарила мама, на первый взгляд обычные трусики, но это только на первый взгляд. Трусики идут с легкой, нежной ткани, приятной для тела. рактически их не ощущаю на теле, люблю легкое белье. ',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      },
      {
        name: 'Іван',
        text: 'Замовляла боді та майки чоловікові. Усе хорошої якості. Розміри як у таблиці. Приємно, що це ще й український виробник. Магазин швидко усе доставив. Дякую.',
        avatar: require('../assets/images/feedbackUsers/vanya.jpg')
      },
      {
        name: 'Влад',
        text: 'Трусики от фирмы Mery мне подарила мама, на первый взгляд обычные трусики, но это только на первый взгляд. Трусики идут с легкой, нежной ткани, приятной для тела. рактически их не ощущаю на теле, люблю легкое белье. ',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      },
      {
        name: 'Іван',
        text: 'Замовляла боді та майки чоловікові. Усе хорошої якості. Розміри як у таблиці. Приємно, що це ще й український виробник. Магазин швидко усе доставив. Дякую.',
        avatar: require('../assets/images/feedbackUsers/vanya.jpg')
      },
      {
        name: 'Влад',
        text: 'Трусики от фирмы Mery мне подарила мама, на первый взгляд обычные трусики, но это только на первый взгляд. Трусики идут с легкой, нежной ткани, приятной для тела. рактически их не ощущаю на теле, люблю легкое белье. ',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      },
      {
        name: 'Іван',
        text: 'Замовляла боді та майки чоловікові. Усе хорошої якості. Розміри як у таблиці. Приємно, що це ще й український виробник. Магазин швидко усе доставив. Дякую.',
        avatar: require('../assets/images/feedbackUsers/vanya.jpg')
      },
      {
        name: 'Влад',
        text: 'Трусики от фирмы Mery мне подарила мама, на первый взгляд обычные трусики, но это только на первый взгляд. Трусики идут с легкой, нежной ткани, приятной для тела. рактически их не ощущаю на теле, люблю легкое белье. ',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      },
      {
        name: 'Іван',
        text: 'Замовляла боді та майки чоловікові. Усе хорошої якості. Розміри як у таблиці. Приємно, що це ще й український виробник. Магазин швидко усе доставив. Дякую.',
        avatar: require('../assets/images/feedbackUsers/vanya.jpg')
      },
      {
        name: 'Влад',
        text: 'Трусики от фирмы Mery мне подарила мама, на первый взгляд обычные трусики, но это только на первый взгляд. Трусики идут с легкой, нежной ткани, приятной для тела. рактически их не ощущаю на теле, люблю легкое белье. ',
        avatar: require('../assets/images/feedbackUsers/vlad.jpg')
      }
    ]
  },
  mutations: {

  },
  getters: {
    getFeedBacks (state) {
      return state.feedbacks
    }
  }
}
