
// `f${(~~(Math.random()*1e8)).toString(16)}`


export default {
  state: {

    shopItems: [
      {
        id: 'f331a425',
        title: 'НАСІННЯ КОНЮШИНИ БІЛОЇ',
        description: 'декорація ландшафту, вирощування на зелений корм та сіно.',
        price: 299,
        img: require('../assets/images/jpeg/kleverbeluj.jpg'),
        fullDescription: [
        'Ця рослина є дуже корисною для будь-якого господаря в побуті, адже саме білу конюшину завжди можна ввести у суміш трав для використовування на пасовиську, щоб отримати небувалий результат. Конюшина чудово поїдається майже будь-якою худобою і в той же час допомагає ґрунтові.',
        'Також рослина знаходиться в списку найважливіших медоносів із результатом у 100 кг. Меду з одного гектара при суцільному виростанні. Мед виходить досить ароматним і напрочуд білим, адже протягом усього літа конюшина виділяє достатньо багато нектару і бурого пилку-обніжжя, що активно збирають бджоли.',
        'Система коріння у білої конюшини стрижнева, а сама рослина низькоросла (15-20 см.). У ґрунт проникає не глибоко.',
        'Насіння невеличке та блистюче, коли свіже, бо при старінні змінює колір на бурий або ж червоний. Сама ж рослина не потребує додаткового догляду та легка для процесу посадки. Для будь-якого хорошого господарства конюшина буде корисною у своїй справі. Замовляйте зараз, щоб не втрачати час в пусте.'
        ],
        harvest: '26-36 ц/га сіна, 120-180 ц/га зеленої маси.',
        seed: ['ручний висів – 120 кг/1,2 кг', 'точний висів (сіялка) – 100 кг/1кг']
      },
      {
        id: 'f5d40aca',
        title: 'НАСІНЯ ЛЮЦЕРНИ',
        description: 'рослина для сидерації, вирощування на зелений корм та сіно.',
        price: 85,
        img: require('../assets/images/jpeg/lucerna.jpg'),
        fullDescription: [
        'Ця бобова рослина володіє багатьма корисними властивостями, як і інші бобові. Люцерна ідеально підходить для сидерального добрива ґрунту завдяки своїм властивостям, які укріпляють і покращують структуру землі, насичуючи її азотом.',
        'Корінна система достатньо міцна і сильно проникає в глиб землі. Саме ж коріння стержневе, що допомагає накопиченню гумусу в ґрунті. Стебла люцерни гіллясті, що утворює сильний кущ із середньою висотою в один метр.',
        'Також люцерна чудово справляється із захистом ґрунту від вітрової і водяної ерозії. Окрім цього люцерна використовується за традиційним призначенням і для зеленого корму. Таким чином купуючи люцерну – Ви отримуєте рослину із багатьма корисними властивостями, яка частково заміняє хімічні добрива.'
        ],
        harvest: '100-150 ц/га',
        seed: ['Ручний висів – 20 кг/ 200 г', 'Точний висів(сіялка) – 15 кг/ 150 г ']
      },
      {
        id: 'f3b642cf',
        title: 'НАСІННЯ ВИКИ ЯРОЇ',
        description: 'вирощування на сіно та зелений корм.',
        price: 20,
        img: require('../assets/images/jpeg/vukajarova.jpg'),
        fullDescription: [
        'Вика яра – це однолітня рослина із родини бобових, які мають безліч корисних властивостей, що властиво для цієї культури. Головними цим властивостями є удобрення ґрунту і використання її в якості корму для практично будь-якої худоби.',
        'Рослина чудово уживається і з іншими злаковими, наприклад, з вівсом, який часто використовують разом для посадки.',
        'Стебла вики достатньо тонкі і мають висоту близько 50 сантиметрів у середньому. Корінна система сильно розвинута, що дозволяє зберігати схожість до 7-8 років. Таким чином купуючи насіння сьогодні – Ви інвестуєте на багато років уперед.'
        ],
        harvest: '60 – 80 ц/ га сіна, 350-400 ц/ га зеленої маси',
        seed: ['Ручний висів – 120 кг/ 1,2 кг', 'Точний висів(сіялка) – 100 кг/ 1 кг']

      },
      {
        id: 'f4b8b6b2',
        title: 'НАСІННЯ КОНЮШИНИ ЧЕРВОНОЇ',
        description: 'рослина для медоносності та ґрунту, вирощування на сіно та зелений корм.',
        price: 75,
        img: require('../assets/images/jpeg/kleverkrasnuj.jpg'),
        fullDescription: [
        'Конюшина червона або малинова є одною із незамінних рослин в будь-якому господарстві. Ця рослина має безліч корисних функцій. Конюшина часто використовується в якості зеленого корму для всієї худоби або ж для підготовки сіна.',
        'У час свого цвіту літом є медоносним. Опилюється перехресним способом – за допомогою бджіл та джмелів. Сам мед виходить досить смачним і в той же час гарним, володіє ніжним ароматом, тонким смаком і відноситься до числа кращих сортів меду.',
        'Важливою якістю червоної конюшини є допомога для ґрунту, бо рослина зазвичай використовується як проміжна, тому таким чином і підтверджує свою користь для землі.',
        'Листки у червоної конюшини черешкові або трійчаті. Корінна система стержнева і неглибока . Насіння ж червоні або бурі, зазвичай більші розміром.',
        'Сьогодні червону конюшину можна зустріти на будь-якому хорошому господарстві, тому неможливо заперечувати її корисність для кожного фермера.'
        ],
        harvest: '24-36 ц/га сіна, 120-180 ц/га зеленої маси.',
        seed: ['Ручний висів – 20 кг/ 200 г.', 'Точний висів(сіялка) – 16 кг/ 160 г']

      },
      {
        id: 'f4e196f9',
        title: 'НАСІННЯ РАЙГРАСУ ГАЗОННОГО',
        description: 'рослина для газону, сидерації, зеленого корму',
        price: 65,
        img: require('../assets/images/jpeg/rajgras.jpg'),
        fullDescription: [
        'Зазвичай ця рослина використовується для заготовки сіна на зиму для великої рогатої худоби, але також її використовують у якості зеленого корму для інших тварин. Трава чудово підходить для пасовиськ.',
        'Райграс також має й іншу функцію декоративної трави, хоча і росте доволі високо до 50 сантиметрів.',
        'Рослина має  дійсно сильну і міцну корінну систему, як для сінокісних трав. Райграс стійкий до багатьох захворювань інших трав, що виділяє з-поміж конкурентів.',
        'Окрім цього трава чудово відростає після скошування. Сам сорт рослини відноситься до числа швидкорослих злаків, які чудово переживають українські зими.'
        ],
        harvest: '40 – 50 ц/га сіна, 200 – 400 ц/ га зеленої маси при 2-3 відкосах.',
        seed: ['Ручний висів – 15 кг./ 150 г.', 'Точний висів( сіялка ) – 10 кг./ 100 г.']
      },
      {
        id: 'f4f103g9',
        title: 'НАСІННЯ ГІРЧИЦІ ЖОВТОЇ',
        description: 'рослина для боротьби із бур’янами та удобрювання ґрунту, вирощування на зелений корм та сіно.',
        price: 20,
        img: require('../assets/images/jpeg/girczucia.jpg'),
        fullDescription: [
        'У першу чергу жовта гірчиця  відома своїми властивостями до розкислення і покращення грунту у вигляді зеленого натурального добрива. Також гірчиця має властивість боротьби із різними бур’янами на полі через свою будову корінної системи.',
        'Ця однолітня рослина досягає довжини від 50 сантиметрів і майже до одного метра, а жовті пелюстки виповняють уже навіть певну декоративну роль . Сама ж рослина не вимоглива в догляді. До погодних умов доволі стійка. Сприйнятлива до різних добрив.',
        'Гірчицю використовують для опилення, що з-рештою робить мед унікальним, смачним та корисним. Жовта гірчиця – це дійсно гарна рослина, яка окрім своєї естетичності несе і корисні властивості її господарю.'
        ],
        seed: ['Ручний висів – 15 кг/ 150 г', 'Точний висів(сіялка) – 10 кг/ 100 г']

      }
    ]
  },
  mutations: {

  },
  getters: {
    getShopItems (state) {
      return state.shopItems
    },
    getProductById (state) {
      return addId => {
        const indx = state.shopItems.findIndex(c => c.id === addId)
        if (indx === -1) {
          return false
        } else {
          return state.shopItems[indx]
        }
      }

    }
  }
}
