
// `f${(~~(Math.random()*1e8)).toString(16)}`


export default {
  state: {

    shopItems: [
      {
        id: 'f331a425',
        title: 'НАСІННЯ КОНЮШИНИ БІЛОЇ',
        description: 'декорація ландшафту, вирощування на зелений корм та сіно.',
        price: 299,
        img: require('../assets/images/jpeg/konbila.jpg'),
        fullDescription: [
        'Ця рослина є дуже корисною для будь-якого господаря в побуті, адже саме білу конюшину завжди можна ввести у суміш трав для використовування на пасовиську, щоб отримати небувалий результат. Конюшина чудово поїдається майже будь-якою худобою і в той же час допомагає ґрунтові.',
        'Також рослина знаходиться в списку найважливіших медоносів із результатом у 100 кг. Меду з одного гектара при суцільному виростанні. Мед виходить досить ароматним і напрочуд білим, адже протягом усього літа конюшина виділяє достатньо багато нектару і бурого пилку-обніжжя, що активно збирають бджоли.',
        'Система коріння у білої конюшини стрижнева, а сама рослина низькоросла (15-20 см.). У ґрунт проникає не глибоко.',
        'Насіння невеличке та блистюче, коли свіже, бо при старінні змінює колір на бурий або ж червоний. Сама ж рослина не потребує додаткового догляду та легка для процесу посадки. Для будь-якого хорошого господарства конюшина буде корисною у своїй справі. Замовляйте зараз, щоб не втрачати час в пусте.'
        ],
        harvest: '26-36 ц/га сіна, 120-180 ц/га зеленої маси.',
        seed: ['ручний висів – 120 кг/1,2 кг', 'точний висів (сіялка) – 100 кг/1кг'],
        categories: ['basil_seeds']
      },
      {
        id: 'f5d40aca',
        title: 'НАСІНЯ ЛЮЦЕРНИ',
        description: 'рослина для сидерації, вирощування на зелений корм та сіно.',
        price: 85,
        img: require('../assets/images/jpeg/lucerna.jpg'),
        fullDescription: [
        'Ця бобова рослина володіє багатьма корисними властивостями, як і інші бобові. Люцерна ідеально підходить для сидерального добрива ґрунту завдяки своїм властивостям, які укріпляють і покращують структуру землі, насичуючи її азотом.',
        'Корінна система достатньо міцна і сильно проникає в глиб землі. Саме ж коріння стержневе, що допомагає накопиченню гумусу в ґрунті. Стебла люцерни гіллясті, що утворює сильний кущ із середньою висотою в один метр.',
        'Також люцерна чудово справляється із захистом ґрунту від вітрової і водяної ерозії. Окрім цього люцерна використовується за традиційним призначенням і для зеленого корму. Таким чином купуючи люцерну – Ви отримуєте рослину із багатьма корисними властивостями, яка частково заміняє хімічні добрива.'
        ],
        harvest: '100-150 ц/га',
        seed: ['Ручний висів – 20 кг/ 200 г', 'Точний висів(сіялка) – 15 кг/ 150 г '],
        categories: ['tomatos_seeds']
      },
      {
        id: 'f3b642cf',
        title: 'НАСІННЯ ВИКИ ЯРОЇ',
        description: 'вирощування на сіно та зелений корм.',
        price: 20,
        img: require('../assets/images/jpeg/vykajara.jpg'),
        fullDescription: [
        'Вика яра – це однолітня рослина із родини бобових, які мають безліч корисних властивостей, що властиво для цієї культури. Головними цим властивостями є удобрення ґрунту і використання її в якості корму для практично будь-якої худоби.',
        'Рослина чудово уживається і з іншими злаковими, наприклад, з вівсом, який часто використовують разом для посадки.',
        'Стебла вики достатньо тонкі і мають висоту близько 50 сантиметрів у середньому. Корінна система сильно розвинута, що дозволяє зберігати схожість до 7-8 років. Таким чином купуючи насіння сьогодні – Ви інвестуєте на багато років уперед.'
        ],
        harvest: '60 – 80 ц/ га сіна, 350-400 ц/ га зеленої маси',
        seed: ['Ручний висів – 120 кг/ 1,2 кг', 'Точний висів(сіялка) – 100 кг/ 1 кг'],
        categories: ['cucamber_seeds']
      },
      {
        id: 'f4b8b6b2',
        title: 'НАСІННЯ КОНЮШИНИ ЧЕРВОНОЇ',
        description: 'рослина для медоносності та ґрунту, вирощування на сіно та зелений корм.',
        price: 75,
        img: require('../assets/images/jpeg/kleverkrasnuj.jpg'),
        fullDescription: [
        'Конюшина червона або малинова є одною із незамінних рослин в будь-якому господарстві. Ця рослина має безліч корисних функцій. Конюшина часто використовується в якості зеленого корму для всієї худоби або ж для підготовки сіна.',
        'У час свого цвіту літом є медоносним. Опилюється перехресним способом – за допомогою бджіл та джмелів. Сам мед виходить досить смачним і в той же час гарним, володіє ніжним ароматом, тонким смаком і відноситься до числа кращих сортів меду.',
        'Важливою якістю червоної конюшини є допомога для ґрунту, бо рослина зазвичай використовується як проміжна, тому таким чином і підтверджує свою користь для землі.',
        'Листки у червоної конюшини черешкові або трійчаті. Корінна система стержнева і неглибока . Насіння ж червоні або бурі, зазвичай більші розміром.',
        'Сьогодні червону конюшину можна зустріти на будь-якому хорошому господарстві, тому неможливо заперечувати її корисність для кожного фермера.'
        ],
        harvest: '24-36 ц/га сіна, 120-180 ц/га зеленої маси.',
        seed: ['Ручний висів – 20 кг/ 200 г.', 'Точний висів(сіялка) – 16 кг/ 160 г'],
        categories: ['cucamber_seeds']
      },
      {
        id: 'f4e196f9',
        title: 'НАСІННЯ РАЙГРАСУ ГАЗОННОГО',
        description: 'рослина для газону, сидерації, зеленого корму',
        price: 65,
        img: require('../assets/images/jpeg/raigras.jpg'),
        fullDescription: [
        'Зазвичай ця рослина використовується для заготовки сіна на зиму для великої рогатої худоби, але також її використовують у якості зеленого корму для інших тварин. Трава чудово підходить для пасовиськ.',
        'Райграс також має й іншу функцію декоративної трави, хоча і росте доволі високо до 50 сантиметрів.',
        'Рослина має  дійсно сильну і міцну корінну систему, як для сінокісних трав. Райграс стійкий до багатьох захворювань інших трав, що виділяє з-поміж конкурентів.',
        'Окрім цього трава чудово відростає після скошування. Сам сорт рослини відноситься до числа швидкорослих злаків, які чудово переживають українські зими.'
        ],
        harvest: '40 – 50 ц/га сіна, 200 – 400 ц/ га зеленої маси при 2-3 відкосах.',
        seed: ['Ручний висів – 15 кг./ 150 г.', 'Точний висів( сіялка ) – 10 кг./ 100 г.'],
        categories: ['cucamber_seeds']
      },
      {
        id: 'f4f103g9',
        title: 'НАСІННЯ ГІРЧИЦІ ЖОВТОЇ',
        description: 'рослина для боротьби із бур’янами та удобрювання ґрунту, вирощування на зелений корм та сіно.',
        price: 20,
        img: require('../assets/images/jpeg/girchyza.jpg'),
        fullDescription: [
        'У першу чергу жовта гірчиця  відома своїми властивостями до розкислення і покращення грунту у вигляді зеленого натурального добрива. Також гірчиця має властивість боротьби із різними бур’янами на полі через свою будову корінної системи.',
        'Ця однолітня рослина досягає довжини від 50 сантиметрів і майже до одного метра, а жовті пелюстки виповняють уже навіть певну декоративну роль . Сама ж рослина не вимоглива в догляді. До погодних умов доволі стійка. Сприйнятлива до різних добрив.',
        'Гірчицю використовують для опилення, що з-рештою робить мед унікальним, смачним та корисним. Жовта гірчиця – це дійсно гарна рослина, яка окрім своєї естетичності несе і корисні властивості її господарю.'
        ],
        seed: ['Ручний висів – 15 кг/ 150 г', 'Точний висів(сіялка) – 10 кг/ 100 г'],
        categories: ['cucamber_seeds']

      },
      {
        id: 'g7g602t9',
        title: 'НАСІННЯ СУДАНКИ',
        description: 'вирощування для зеленого корму та сіна.',
        price: 30,
        img: require('../assets/images/jpeg/sydanka.jpg'),
        fullDescription: [
          'Суданка або ж суданська трава вирощується для зеленого корму або для заготовки сіна у майбутньому. В Україні відома своїми властивостями хорошого росту в умовах засухи, хоча це і пояснюється походженням рослини із Африки на початку 20-го століття. Як результат, суданська трава досить любить тепло і сприймає високі температури без страшних наслідків.',
          'Суданка – це також злакова рослина, тому її функціональність доволі висока. ЇЇ використовують у тому ж числі і для сидерації землі, а також при заготовці сінажу.',
          ' Хоча на початку своєї вегетації росте вона доволі повільно. Все ж із часом приносить непоганий урожай, особливо на чорноземах і темно-каштанових землях України.'
        ],
        seed: ['Ручний висів – 15 кг/ 150 г', 'Точний висів(сіялка) – 10 кг/ 100 г'],
        categories: ['cucamber_seeds']

      },
      {
        id: 'n4y832t9',
        title: 'НАСІННЯ ГРЕЧКИ',
        description: 'рослина кормова, медоносна.',
        price: 30,
        img: require('../assets/images/jpeg/grechka.jpg'),
        fullDescription: [
          'Гречка є одною з найпопулярніших круп’яних рослини в Україні. ЇЇ особливістю є те, що вона хоч і є зерновою, усе ж не відноситься до злакових рослин. Гречка належить до однорічних рослин, які у висоту досягають до 60 сантиметрів, а листя зазвичай мають серцеподібну форму.',
          'В Україні гречку використовують у багатьох корисних цілях. Через свою високу концентрацію вітамінів гречану кашу застосовують для дієтичного лікування, а сама  страва у нашій країні навіть уважається національною. У кулінарії цю ж рослину часто беруть для перероблення на гречане борошно, яке стало таким популярним останнім часом. ',
          'Пасічники ж часто садять цю рослину через її високу медоносність, яку ми можемо гарантувати. Сам мед виходить напрочуд смачним та цілющим. Ця рослина корисна у багатьох напрямках, важливо лиш правильно її використовувати.'
        ],
        seed: ['Ручний висів – 40 кг/ 400 г', 'Точний висів(сіялка) – 35 кг/ 350 г'],
        categories: ['cabbage_seeds']

      },
      {
        id: 't2e542r9',
        title: 'НАСІННЯ ЛЮПИНУ',
        description: 'вирощування для сидерації, медоносності, зеленого корму та декору.',
        price: 23,
        img: require('../assets/images/jpeg/lupyn.jpg'),
        fullDescription: [
          'Люпин належить до бобових рослин. Це сімейство зазвичай називають однолітнім. Рослина за час свого росту досягає висоти у 50-90 сантиметрів, має чудовий естетичний вигляд через свої різнокольорові квіти. Коріння у рослини стержневе та досягає глибини у ґрунті до 1 метру, через що добре переносить навіть заморозки до 5 градусів.',
          'Рослину часто використовують для накопичення азоту та органічної речовини в ґрунті. Люпин використовують у якості сидерата та просто красивої рослини. Ці бобові чудово переносять посуху через свою систему коріння. Люпин це головне зелене добриво, що дозволяє економити на дорожчих препаратах без шкоди довкіллю із нотками природньої краси. ',
          'Бобова рослина є також хорошим зеленим кормом для скоту, а також особливим медоносом, що точно вирізняється з-поміж інших. Його насіння можна придбати у нас, щоб на власному досвіді випробувати всі корисні властивості рослини.'
        ],
        seed: ['Ручний висів – 180 кг/ 200 г', 'Точний висів(сіялка) – 120 кг/ 120 г'],
        categories: ['forest_mashrooms_seeds']

      },
      {
        id: 'i4d472k9',
        title: 'НАСІННЯ ФАЦЕЛІЇ',
        description: 'рослина для медоносності, силосу та зеленого корму.',
        price: 130,
        img: require('../assets/images/jpeg/phacelia.jpg'),
        fullDescription: [
          'Фацелія є чудовою однорічною рослиною, що має неабияке застосування. Її стебла досягають висоти до 80 сантиметрів і навіть більше, а суцвіття вміщують до 30-40 квітів.',
          'Бджоли особливо люблять цю рослину та постійно навідуються до неї під час її цвітіння, а найкращим для цього періодом є початок липня. Мед із фацелії відносять до вищих  сортів та варто сказати, що не дарма, бо на смак він виходить досить витонченим, а колір має відповідно світлий.',
          'З-поміж іншого фацелію використовують і як зелений корм, і як силос, що так полюбляється усією худобою. Окрім усього цього фацелія – це ще й чудове зелене добриво, яке економить багато коштів на заміну різним хімічним добривам.'
        ],
        seed: ['Ручний висів – 12 кг/ 120 г', 'Точний висів(сіялка) – 10 кг/ 100 г'],
        categories: ['forest_mashrooms_seeds']

      },
      {
        id: 'h7m422o9',
        title: 'НАСІННЯ ОЛІЙНОЇ РЕДЬКИ',
        description: 'вирощування для зеленого корму та сіна, а також силосу та пасовиськ.',
        price: 30,
        img: require('../assets/images/jpeg/olijnaredka.jpg'),
        fullDescription: [
          'Олійна редька  є однолітньою трав’янистою рослиною, яку використовують для вирощування зеленого корму або створення пасовиськ для худоби. Також ця редька має й інші властивості, наприклад, її часто використовують для трав’яної муки, силосу, що лиш додає цінності цій рослині.',
          'Сама ж редька досягає висоти в один метр і більше та має міцний стержневий корінь. Спеціального чи додаткового догляду вона не потребує.',
          'Та навіть на цьому весь позитив не закінчується, адже фермери зауважили природню властивість  редьки, як засобу для збору нектару бджолами. Мед виходить світлим і з вищими смаковими якостями.',
            'Олійна редька популярна у фермерів, які тримають корів, адже після їх випасу на такому полі – корови починають давати більш жирне та краще молоко, що дозволяє зекономити на додаткових кормах.',
            'Що ж стосується ґрунту, то рослина активно бореться з різноманітними патогенними мікроорганізмами в землі і поглинає бур’яни. Купуючи насіння цієї рослини – Ви отримуєте багатофункціональний інструмент, який в умілих руках принесе небувалу користь.'
        ],
        seed: ['Ручний висів – 120 кг/ 1,2 кг', 'Точний висів(сіялка) – 100 кг/ 100 кг'],
        categories: ['forest_mashrooms_seeds']

      }
      ,
      {
        id: 't2e542r9',
        title: 'НАСІННЯ ГРЯСТИЦІ',
        description: 'рослина для створення пасовиськ, декоративна, вирощування для сіна та зеленого корму.',
        price: 90,
        img: require('../assets/images/jpeg/grastusa.jpg'),
        fullDescription: [
          'Цей верховий злак має багацько корисних властивостей для терплячих господарів, які розуміють всі переваги цієї рослини. Грястиця – це в першу чергу багаторічний не плотнокустовий злак, який  починає вегетацію достатньо рано на весні. У той же час грястиця відростає доволі швидко після скошування або ж випасу худоби.',
          'Рослина ідеально підходить для створення пасовиськ, бо подобається худобі та має високу стійкість до витоптування. Тримається в ґрунті рослина теж достатньо довго до 8 і більше років.',
          'Грястиця чудово поєднується і з іншими рослинами, такими як: луговий мятлик(тонконіг) чи китник, а також канарник, люцерна і еспарцет. Ці комбінації стрімко збільшують урожай на полі і непогано вживаються один з одним.'
        ],
        seed: ['Ручний висів – 10 кг/ 100 г', 'Точний висів(сіялка) – 8 кг/ 80 г'],
        categories: ['forest_mashrooms_seeds', 'cucamber_seeds', 'pears_seeds', 'currant_seeds']
      }

    ]
  },
  mutations: {

  },
  getters: {
    getShopItems (state) {
      return state.shopItems
    },
    getProductById (state) {
      return addId => {
        const indx = state.shopItems.findIndex(c => c.id === addId)
        if (indx === -1) {
          return false
        } else {
          return state.shopItems[indx]
        }
      }

    }
  }
}
